[
    {
        "id": 1,
        "name": "Wireless Headphones",
        "category": "Electronics",
        "price": 99.99,
        "image": "images/headphones.png",
        "description": "Experience immersive audio with these high-quality wireless headphones. Designed for maximum comfort, they feature plush ear cushions and a lightweight frame. The active noise cancellation lets you focus on your music or calls in noisy environments. With a long battery life, you can enjoy uninterrupted listening throughout the day. Perfect for work, travel, or leisure."
    },
    {
        "id": 2,
        "name": "Smart Watch",
        "category": "Electronics",
        "price": 199.99,
        "image": "images/smartwatch.png",
        "description": "Keep your life organized with this sleek and versatile smartwatch. Track your fitness goals, monitor health metrics, and receive notifications on the go. The vibrant touchscreen display offers easy navigation and customization options. Durable and water-resistant, it's built to keep up with your active lifestyle. A perfect blend of technology and style."
    },
    {
        "id": 3,
        "name": "Yoga Mat",
        "category": "Fitness",
        "price": 25.99,
        "image": "images/yogamat.png",
        "description": "Enhance your yoga sessions with this eco-friendly yoga mat. Crafted with a non-slip surface, it ensures safety and stability during poses. The lightweight design makes it easy to carry to your studio or gym. It provides ample cushioning to protect your joints and enhance comfort. Ideal for all fitness levels, from beginners to experts."
    },
    {
        "id": 4,
        "name": "Running Shoes",
        "category": "Fitness",
        "price": 75.49,
        "image": "images/runningshoes.png",
        "description": "Step into comfort with these lightweight and breathable running shoes. Designed to reduce impact, they feature cushioned soles and supportive arches for long runs. The durable materials ensure lasting performance on various terrains. Stylish and functional, they're perfect for workouts, casual wear, or outdoor adventures. Available in multiple colors to match your style."
    },
    {
        "id": 5,
        "name": "Coffee Maker",
        "category": "Home Appliances",
        "price": 49.99,
        "image": "images/coffeemaker.png",
        "description": "Brew the perfect cup of coffee every morning with this compact coffee maker. Featuring a quick brewing process, it saves time while delivering rich and flavorful coffee. Its user-friendly design makes it easy to operate and clean. The space-saving structure fits neatly on any kitchen counter. A must-have for every coffee lover."
    },
    {
        "id": 6,
        "name": "Air Purifier",
        "category": "Home Appliances",
        "price": 129.99,
        "image": "images/airpurifier.png",
        "description": "Breathe easier with this powerful air purifier designed to improve indoor air quality. It effectively removes allergens, dust, and pollutants, ensuring a healthier environment. The quiet operation makes it suitable for bedrooms and living spaces. Its sleek design blends seamlessly with modern interiors. Perfect for families, pet owners, or anyone seeking cleaner air."
    },
    {
        "id": 7,
        "name": "Office Chair",
        "category": "Furniture",
        "price": 159.99,
        "image": "images/officechair.png",
        "description": "Work comfortably with this ergonomic office chair featuring lumbar support. Adjustable height and armrests ensure personalized comfort during long hours. The breathable mesh back promotes airflow, preventing discomfort. Its sturdy construction supports various body types while maintaining a sleek look. Enhance your productivity with this functional and stylish chair."
    },
    {
        "id": 8,
        "name": "Wooden Desk",
        "category": "Furniture",
        "price": 299.99,
        "image": "images/woodendesk.png",
        "description": "Create a productive workspace with this spacious wooden desk. Its minimalist design complements any decor style while providing ample surface area for your essentials. The sturdy build ensures stability and durability for years to come. With smooth edges and a polished finish, it combines aesthetics with functionality. Ideal for home offices or study rooms."
    },
    {
        "id": 9,
        "name": "Cooking Set",
        "category": "Kitchen",
        "price": 89.99,
        "image": "images/cookingset.png",
        "description": "Upgrade your kitchen with this complete cooking set featuring non-stick pots and pans. Perfect for preparing a variety of meals, it ensures even heat distribution for consistent results. The ergonomic handles offer a comfortable grip while cooking. Easy to clean and dishwasher-safe, it simplifies your kitchen tasks. Ideal for beginners and seasoned chefs alike."
    },
    {
        "id": 10,
        "name": "Blender",
        "category": "Kitchen",
        "price": 59.99,
        "image": "images/blender.png",
        "description": "Make delicious smoothies and shakes effortlessly with this high-speed blender. Its powerful motor crushes ice and blends ingredients smoothly. The compact design saves counter space without compromising functionality. Easy-to-clean detachable parts make maintenance a breeze. A versatile tool for healthy eating and creative recipes."
    },
    {
        "id": 11,
        "name": "Gaming Keyboard",
        "category": "Electronics",
        "price": 69.99,
        "image": "images/gamingkeyboard.png",
        "description": "Elevate your gaming experience with this RGB mechanical keyboard. Customizable keys and dynamic lighting effects add a personal touch to your setup. The tactile feedback ensures precise control during intense gameplay. Built with durable materials, it withstands hours of use. A must-have accessory for serious gamers."
    },
    {
        "id": 12,
        "name": "Cycling Helmet",
        "category": "Fitness",
        "price": 35.99,
        "image": "images/cyclinghelmet.png",
        "description": "Stay safe and comfortable on your cycling adventures with this lightweight helmet. It features a sturdy outer shell and ample ventilation for breathability. The adjustable straps ensure a secure and snug fit. Designed for both safety and style, it suits riders of all skill levels. Perfect for commuting, racing, or casual rides."
    }
]